posts/Linux/2017-09-05-HPE-MicroServer-MSU.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-10 Tue 08:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marvell Storage Utility on HPE ProLiant MicroServer Gen10</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Adventures when using having to deal with proprietary drivers on Arch Linux."
 />
<meta name="keywords" content="MSU, 88SE9230, Marvell, HPE, MicroServer, RAID, SMART, SATA, SCSI" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Marvell Storage Utility on HPE ProLiant MicroServer Gen10</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35c3f7e">Marvell SATA controller</a></li>
<li><a href="#org8fd8f69">Marvell controller package</a></li>
</ul>
</div>
</div>

<div id="outline-container-org35c3f7e" class="outline-2">
<h2 id="org35c3f7e">Marvell SATA controller</h2>
<div class="outline-text-2" id="text-org35c3f7e">
<p>
Recently I purchased an HPE ProLiant MicroServer Gen10 which comes with the
Marvell SATA controller 88SE9230, also called Marvell Storage Utility (MSU). As
far as I know, this controller has an ARM chip to provide RAID 0 (non-redundant
combination of disks), RAID 1 (straight mirroring) or RAID 10 (a combination of
RAID 0 and RAID 1).
</p>

<p>
Neither Marvell nor HPE do provide drivers for generic Linux systems but they do
provide a package for ClearOS which uses the Red Hat Package Manager (RPM).
</p>

<p>
Initially, I tried to manage the RAID using the Marvell BIOS utility which can
be accessed by the EFI shell. The BIOS utility and the user guide can be
downloaded from the <a href="https://www.hpe.com/us/en/support.html">HPE support center</a>. However, this procedure is slow and
complicated, especially if the server is headless, as in my case. Furthermore,
monitoring the disks with SMART data is also impossible. So I decided to invest
some time in amending the ClearOS package for Arch Linux and provide an <a href="https://aur.archlinux.org/packages/marvell-msu/">AUR
package</a>.
</p>
</div>
</div>

<div id="outline-container-org8fd8f69" class="outline-2">
<h2 id="org8fd8f69">Marvell controller package</h2>
<div class="outline-text-2" id="text-org8fd8f69">
<p>
I had serious trouble running the original scripts and daemons because they are
(a) written for ClearOS and (b) expect the generic but outdated SCSI kernel
module <a href="http://www.tldp.org/HOWTO/SCSI-2.4-HOWTO/sg.html">sg</a> to be loaded. I provide replacements with the same functionality:
</p>
<ol class="org-ol">
<li><a href="https://aur.archlinux.org/cgit/aur.git/tree/MSUAgent?h=marvell-msu">MSUAgent</a> - The MSU Event Manager.</li>
<li><a href="https://aur.archlinux.org/cgit/aur.git/tree/MSUWebService?h=marvell-msu">MSUWebServer</a> - The MSU Web Server (manual access at port 8045).</li>
<li><a href="https://aur.archlinux.org/cgit/aur.git/tree/MSUStart?h=marvell-msu">MSUStart</a> - A small script to access the web interface.</li>
</ol>

<p>
These scripts also pull the <code>sg</code> module in case it is not loaded.
</p>

<p>
For my purposes however (I do not need a web interface), the MSU client <code>mvcli</code>,
which is located in the folder <code>/opt/marvell/storage/cli</code> is all I need. Don't
forget to manually load the <code>sg</code> module, which sets up the SCSI devices for this
script, e.g., with
</p>
<pre class="example">
sudo modprobe -a sg

</pre>

<p>
Then, the SMART data can be retrieved, e.g., with
</p>
<pre class="example">
sudo /opt/marvell/storage/cli/mvcli smart -p 0

</pre>

<p>
Awesome :-)!
</p>

<p>
In the course of this project, I also stumbled upon other very useful SCSI
related software: <code>lsscsi</code>, <code>sg3_utils</code>, <code>sdparm</code>, <code>hdidle</code>.
</p>

<p>
I am still having trouble with monitoring temperature (e.g., CPU temperature),
please leave a note if you know an easy way to achieve this.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Marvell Storage Utility on HPE ProLiant MicroServer Gen10)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><p>Copyright 2015-2018 Dominik Schrempf</p>
<p>Last updated <span class="timestamp-wrapper"><span class="timestamp">2018-04-10</span></span></p>
<p>Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="https://orgmode.org">Org</a> mode 9.1.9) </p>
<p><a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML</p>
</div>
</div>
</body>
</html>
